doodleduel_api/app/controllers/words_controller.rb

  def index
    @words = Word.all
---
SELECT "words".* FROM "words"

    def set_word
      @word = Word.find(params[:id])
---
SELECT "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]