doodleduel_api/app/controllers/words_controller.rb

SELECT "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_word
      @word = Word.find(params[:id])